Lo primero que debo de hacer es importar el dataset en un dataframe

In [17]:
import pandas as pd

In [18]:
dataset = pd.read_csv("titanic.csv")

In [19]:
# Muestro solo la cabecera para ver si se ha importado bien
dataset[:3]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

Ahora indexo por nombre de pasajero

In [20]:
dataset = dataset.set_index('Name')

# Vuelvo a mostrar la cabecera para ver que se está indexando correctamente
dataset[:3]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Name,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

El siguiente paso es deletear ticket number y cabina

In [21]:
dataset = dataset.drop(columns= ['Ticket', 'Cabin'])

# Muestro la parte superior para volver a ver que se ha eliminado
dataset[ :3]

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Embarked
Name,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,7.2500,S
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,71.2833,C
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,7.9250,S

Siguiente paso: Análisis de columnas nulas y reemplazo de valores

In [22]:
# Se obtienen las columnas que tengan algún NaN, y le pongo el toList para obtenerlo más vistoso
dataset.columns[dataset.isna().any()].tolist()

['Age', 'Embarked']

In [23]:
# Primero obtengo la media de las columnas

print(dataset.mean())

# Ahora relleno los na con la media

dataset = dataset.fillna(dataset.mean())

# Ahora compruebo que no quede ningún na con la sentencia del chunk anterior

dataset.columns[dataset.isna().any()].tolist()

# Como queda la de embarked (normal, es categórica), tengo que rellenarla a mano

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

['Embarked']

In [24]:
# Como no tengo el valor, voy a ver la frecuencia con la que embarcaron los pasajeros
# de un lado u otro, y le asignaré el de mayor valor para la simplificación del problema

dataset.groupby('Embarked').count()

          PassengerId  Survived  Pclass  Sex  Age  SibSp  Parch  Fare
Embarked
C                 168       168     168  168  168    168    168   168
Q                  77        77      77   77   77     77     77    77
S                 644       644     644  644  644    644    644   644

In [25]:
# Como se puede ver, una gran mayoría vienen de Southampton, por lo que asignaré los NaN a allí
# Como solo hay NaN en esa columna, puedo usar libremente el método replace

import numpy as np

dataset = dataset.replace(np.NaN, 'S')

# Se comprueba si queda alguna columna con NaN

dataset.columns[dataset.isna().any()].tolist()

[]

In [52]:
# Como no queda ninguna columna con NaN, puedo proseguir.

# Lo que voy a hacer es guardar el DataFrame limpiado como csv por si se quiere utilizar posteriormente

dataset.to_csv("titanic_limpio.csv", sep='\t')

Ahora es importante cambiar todas las variables categoricas a dummy

Siguiente paso: Separación de los datos en train y test

In [27]:
from sklearn.model_selection import train_test_split

In [51]:
x = dataset[dataset.columns[4:10]]
y = dataset.Survived

x_train, x_test, y_train, y_test= train_test_split(x, y, test_size = 0.33, random_state = 5)